<a href="https://colab.research.google.com/github/Machocho254/Week-3-IP/blob/master/Moringa_Data_Science_Prep_W3_Independent_Project_2019_07_Machocho_Mengo_Python.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
#Start with importing all the dictionaries
import pandas as pd
import numpy as np

In [3]:
# creating pandas dataframes 
#/content/cells_geo_description.xlsx

geo_descr = pd.read_excel('/content/cells_geo_description.xlsx', header = 0, sheet_name = 0)
geo_descr

     Column name                                        Description  Format
0         VILLES                                               City  String
1         STATUS                                  In Service or not  String
2   LOCALISATION                                  in ABIDJAN or not  String
3     DECOUPZONE                                  Geographical Zone  String
4       ZONENAME                                       Name of Zone  String
5      LONGITUDE                                          Longitude   Float
6       LATITUDE                                           Latitude   Float
7         REGION                                             Region  String
8           AREA                                               Area  String
9        CELL_ID                                     ID of the cell  String
10     SITE_CODE  Site (there are several cells per site, severa...  String

In [16]:
geo_descr.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11 entries, 0 to 10
Data columns (total 3 columns):
Column name    11 non-null object
Description    11 non-null object
Format         11 non-null object
dtypes: object(3)
memory usage: 392.0+ bytes

In [17]:
geo_descr.describe()

       Column name        Description  Format
count           11                 11      11
unique          11                 11       2
top         VILLES  in ABIDJAN or not  String
freq             1                  1       9

In [14]:
cdr_descr = pd.read_excel('/content/CDR_description.xlsx', header = 1, sheet_name = 0)
cdr_descr

           PRODUCT                                       Voice or SMS   String
0            VALUE                                      Billing price  Integer
1        DATE_TIME               Time in format yyyy-MM-dd hh:mm:ss.0   String
2     CELL_ON_SITE  Which cell in the site was used (not needed here)  Integer
3  DW_A_NUMBER_INT  Anonymized phone number of the person for whic...   String
4  DW_B_NUMBER_INT        Anonymized phone number of the counterparty   String
5        COUNTRY_A                  Country of party A (useless here)   String
6        COUNTRY_B                  Country of party B (useless here)   String
7          CELL_ID                                     ID of the cell   String
8          SITE_ID                                     ID of the SITE   String

In [15]:
cells_geo = pd.read_csv('/content/cells_geo.csv')
cells_geo.head()

  ;VILLES;STATUS;LOCALISATION;DECOUPZONE;ZONENAME;LONGITUDE;LATITUDE;REGION;AREA;CELL_ID;SITE_CODE
0  0;ADJAME;In Service;ABIDJAN;"""Abidjan_EST";AG...
1  1;ADJAME;In Service;ABIDJAN;"""Abidjan_EST";AG...
2  2;ADJAME;In Service;ABIDJAN;"""Abidjan_EST";AG...
3  3;ASSINIE;In Service;INTERIEUR;Grand-EST;"ASSI...
4  4;ASSINIE;In Service;INTERIEUR;Grand-EST;"ASSI...

In [31]:
cells_geo = pd.read_csv('/content/cells_geo.csv', sep='[;]' , engine= 'python')
cells_geo.rename(columns = {'SITE_CODE' : 'SITE_ID'}, inplace = True)
cells_geo.head()

   Unnamed: 0   VILLES      STATUS  ... AREA     CELL_ID     SITE_ID
0           0   ADJAME  In Service  ...  NaN  fbb2e75af3  0bb492ef17
1           1   ADJAME  In Service  ...  NaN  1502501d78  0bb492ef17
2           2   ADJAME  In Service  ...  NaN  0c2e182a0c  0bb492ef17
3           3  ASSINIE  In Service  ...  NaN  69bdfc69fd  8a1e6ce31f
4           4  ASSINIE  In Service  ...  NaN  7a1029d2ab  8a1e6ce31f

[5 rows x 12 columns]

In [34]:
telcom_1 = pd.read_csv('/content/Telcom_dataset (1).csv')
telcom_1.rename(columns= {'PRODUTC':'PRODUCT', 'DATETIME':'DATE_TIME', 'DW_A_NUMBER_INT':'DW_A_NUMBER', 'DW_B_NUMBER_INT':'DW_B_NUMBER'}, inplace=True)
telcom_1.head()

  PRODUCT  VALUE              DATE_TIME  ... COUNTRY_B     CELL_ID     SITE_ID
0   Voice      0  2012-05-06 23:04:37.0  ...     19e2e  /TJNe+Mmtu  /TJNe+Mmtu
1     sms      0  2012-05-06 23:05:25.0  ...     19e2e  /+cKZKIp41  /+cKZKIp41
2     sms     25  2012-05-06 23:05:41.0  ...     19e2e  /u0FSD+ahi  /u0FSD+ahi
3   Voice     56  2012-05-06 23:05:42.0  ...     19e2e  +cNeJzsTp3  +cNeJzsTp3
4   Voice     14  2012-05-06 23:06:29.0  ...     19e2e  051KhYDCpv  051KhYDCpv

[5 rows x 10 columns]

In [35]:
telcom_1.describe()

             VALUE
count  5001.000000
mean     25.869626
std     101.934502
min       0.000000
25%       0.000000
50%       0.000000
75%      25.000000
max    4440.000000

In [26]:
telcom_2 = pd.read_csv('/content/Telcom_dataset2 (1).csv')
telcom_2

     PRODUCT  VALUE              DATE_TIME  ... COUNTRY_B     CELL_ID     SITE_ID
0        sms      0  2012-05-07 23:02:06.0  ...     19e2e  +854AcBQT2  +854AcBQT2
1      Voice      0  2012-05-07 23:03:44.0  ...     19e2e  +854AcBQT2  +854AcBQT2
2        sms      0  2012-05-07 23:04:06.0  ...     19e2e  +laSrk7g6q  +laSrk7g6q
3      Voice     37  2012-05-07 23:04:48.0  ...     19e2e  /xvRrCVKoQ  /xvRrCVKoQ
4        sms     25  2012-05-07 23:04:58.0  ...     19e2e  +bO+qkSonO  +bO+qkSonO
...      ...    ...                    ...  ...       ...         ...         ...
4996     sms      0  2012-05-08 00:01:53.0  ...     19e2e  896459aace  b7d00e59e4
4997     sms     25  2012-05-08 00:01:53.0  ...     19e2e  7e90b35166  211015b14d
4998     sms      0  2012-05-08 00:01:53.0  ...     19e2e  fe70e431df  c7ea989264
4999    data      0  2012-05-08 00:01:53.0  ...     OTHER  ffa6759bb2         NaN
5000   Voice      0  2012-05-08 00:01:53.0  ...     19e2e  8630058aca  b47a998a3e

[5001 rows x 10 columns]

In [19]:
telcom_2.describe()

             VALUE
count  5001.000000
mean     24.334933
std      97.471586
min       0.000000
25%       0.000000
50%       0.000000
75%      25.000000
max    3380.000000

In [36]:
telcom_3 = pd.read_csv('/content/Telcom_dataset3 (1).csv')
telcom_3.rename(columns= {'DW_A_NUMBER_INT':'DW_A_NUMBER', 'DW_B_NUMBER_INT':'DW_B_NUMBER','CELLID':'CELL_ID','SIET_ID':'SITE_ID'}, inplace=True)
telcom_3.head()

  PRODUCT  VALUE              DATE_TIME  ... COUNTRY_B     CELL_ID     SITE_ID
0   Voice     61  2012-05-08 23:01:28.0  ...     19e2e  +38u2u/rfx  +38u2u/rfx
1     sms      0  2012-05-08 23:01:31.0  ...     19e2e  +Fs4mTvdKx  +Fs4mTvdKx
2   Voice     10  2012-05-08 23:02:59.0  ...     19e2e  +ZaaZozy/+  +ZaaZozy/+
3     sms      0  2012-05-08 23:03:04.0  ...     19e2e  +cNeJzsTp3  +cNeJzsTp3
4   Voice     22  2012-05-08 23:03:16.0  ...     19e2e  /eeMklgyJA  /eeMklgyJA

[5 rows x 10 columns]

In [20]:
telcom_3.describe()

              VALUE
count   5001.000000
mean      26.441512
std      224.200217
min        0.000000
25%        0.000000
50%        0.000000
75%       25.000000
max    12900.000000

In [0]:
!pwd

/content

In [0]:
!git clone https://github.com/Machocho254/Week-3-IP.git

Cloning into 'Week-3-IP'...
warning: You appear to have cloned an empty repository.

In [0]:
!git clone https://github.com/Machocho254/Week-3-IP.git

fatal: destination path 'Week-3-IP' already exists and is not an empty directory.

In [37]:
# Average use of voice bundle in the first dataframe
telcom_1[telcom_1['PRODUCT'] == 'Voice'].VALUE.mean()

49.06219017575484

In [27]:
telcom_2[telcom_2['PRODUCT'] == 'Voice'].VALUE.mean()

54.29485834207765

In [28]:
telcom_3[telcom_3['PRODUCT'] == 'Voice'].VALUE.mean()

65.04737183646982

In [0]:
# OUt of all the three datasets, the

In [38]:
# Average use of the sms bundle in the first dataframe
telcom_1[telcom_1['PRODUCT'] == 'sms'].VALUE.mean()

6.821772151898734

In [30]:
telcom_2[telcom_2['PRODUCT'] == 'sms'].VALUE.mean()

5.458565908115071

In [31]:
telcom_3[telcom_3['PRODUCT'] == 'sms'].VALUE.mean()

9.84495843874232

In [59]:
# To filter the data to use, we shall select the Product, VALUES, DATETIME and CELL ID columns

df1 = telcom_1[["PRODUTC","VALUE","DATETIME", "CELL_ID"]]
df1

     PRODUTC  VALUE               DATETIME     CELL_ID
0      Voice      0  2012-05-06 23:04:37.0  /TJNe+Mmtu
1        sms      0  2012-05-06 23:05:25.0  /+cKZKIp41
2        sms     25  2012-05-06 23:05:41.0  /u0FSD+ahi
3      Voice     56  2012-05-06 23:05:42.0  +cNeJzsTp3
4      Voice     14  2012-05-06 23:06:29.0  051KhYDCpv
...      ...    ...                    ...         ...
4996     sms    100  2012-05-07 00:01:54.0  0c2371d9bc
4997   Voice      1  2012-05-07 00:01:54.0  5fb791cf56
4998   Voice      0  2012-05-07 00:01:54.0  7773627c12
4999   Voice      0  2012-05-07 00:01:54.0  3f4af49d6c
5000   Voice      7  2012-05-07 00:01:54.0  6f4d9b77a5

[5001 rows x 4 columns]

In [41]:
df1[df1['PRODUTC'] == "sms"].count()

PRODUTC     1975
VALUE       1975
DATETIME    1975
CELL_ID     1975
dtype: int64

In [42]:
df1[df1['PRODUTC'] == 'Voice'].count()

PRODUTC     2219
VALUE       2219
DATETIME    2219
CELL_ID     2219
dtype: int64

In [40]:

df2 = telcom_2[["PRODUCT","VALUE","DATE_TIME", "CELL_ID"]]
df2

     PRODUCT  VALUE              DATE_TIME     CELL_ID
0        sms      0  2012-05-07 23:02:06.0  +854AcBQT2
1      Voice      0  2012-05-07 23:03:44.0  +854AcBQT2
2        sms      0  2012-05-07 23:04:06.0  +laSrk7g6q
3      Voice     37  2012-05-07 23:04:48.0  /xvRrCVKoQ
4        sms     25  2012-05-07 23:04:58.0  +bO+qkSonO
...      ...    ...                    ...         ...
4996     sms      0  2012-05-08 00:01:53.0  896459aace
4997     sms     25  2012-05-08 00:01:53.0  7e90b35166
4998     sms      0  2012-05-08 00:01:53.0  fe70e431df
4999    data      0  2012-05-08 00:01:53.0  ffa6759bb2
5000   Voice      0  2012-05-08 00:01:53.0  8630058aca

[5001 rows x 4 columns]

In [43]:
df2[df2['PRODUCT'] == "sms"].count()

PRODUCT      2329
VALUE        2329
DATE_TIME    2329
CELL_ID      2329
dtype: int64

In [44]:
df2[df2['PRODUCT'] == "Voice"].count()

PRODUCT      1906
VALUE        1906
DATE_TIME    1906
CELL_ID      1906
dtype: int64

In [48]:
df3 = telcom_3[["PRODUCT","VALUE","DATE_TIME", "CELLID"]]
df3

     PRODUCT  VALUE              DATE_TIME      CELLID
0      Voice     61  2012-05-08 23:01:28.0  +38u2u/rfx
1        sms      0  2012-05-08 23:01:31.0  +Fs4mTvdKx
2      Voice     10  2012-05-08 23:02:59.0  +ZaaZozy/+
3        sms      0  2012-05-08 23:03:04.0  +cNeJzsTp3
4      Voice     22  2012-05-08 23:03:16.0  /eeMklgyJA
...      ...    ...                    ...         ...
4996   Voice      0  2012-05-09 00:01:43.0  2aa04dcab7
4997   Voice     62  2012-05-09 00:01:43.0  7f1f2f889f
4998   Voice     32  2012-05-09 00:01:43.0  a4731e780e
4999   Voice     30  2012-05-09 00:01:43.0  98ed726da2
5000   Voice     60  2012-05-09 00:01:43.0  1c11a2fcbb

[5001 rows x 4 columns]

In [49]:
df3[df3['PRODUCT'] == "sms"].count()

PRODUCT      2767
VALUE        2767
DATE_TIME    2767
CELLID       2767
dtype: int64

In [50]:
df3[df3['PRODUCT'] == "Voice"].count()

PRODUCT      1541
VALUE        1541
DATE_TIME    1541
CELLID       1541
dtype: int64

In [60]:
# To get the most used infrastructure, we get the most used site 
df1[df1['PRODUTC'] == "Voice"].CELL_ID.max()

'ffcc507579'

In [61]:
df1[df1['PRODUTC'] == "sms"].CELL_ID.max()

'ffcc507579'

In [62]:
df2[df2['PRODUCT'] == "Voice"].CELL_ID.max()

'ffb86d66d2'

In [63]:
df2[df2['PRODUCT'] == "sms"].CELL_ID.max()

'ffcc507579'

In [64]:
df3[df3['PRODUCT'] == "Voice"].CELLID.max()

'fed537f3b2'

In [65]:
df3[df3['PRODUCT'] == "sms"].CELLID.max()

'ff99709d62'

In [0]:
# Which city with highest number of voice calls

df_new = cells_geo.groupby('STATUS')['CELL_ID'].count()
df_new
df_new.sort_values(ascending=False).iloc[:5]

In [0]:
cells_geo[cells_geo[';STATUS'] == "In Service"].count()

In [22]:
cells_geo.columns.str.split(';').str[0].tolist()
['VILLES','STATUS','LOCALISATION','DECOUPZONE','ZONENAME','LONGITUDE','LATITUDE','REGION','AREA','CELL_ID','SITE_CODE']

['VILLES',
 'STATUS',
 'LOCALISATION',
 'DECOUPZONE',
 'ZONENAME',
 'LONGITUDE',
 'LATITUDE',
 'REGION',
 'AREA',
 'CELL_ID',
 'SITE_CODE']

In [46]:
#merging 1, 2, 3 datasets
frames = [telcom_1, telcom_2, telcom_3]
df4 = pd.concat(frames)
df4.head()

  PRODUCT  VALUE              DATE_TIME  ... COUNTRY_B     CELL_ID     SITE_ID
0   Voice      0  2012-05-06 23:04:37.0  ...     19e2e  /TJNe+Mmtu  /TJNe+Mmtu
1     sms      0  2012-05-06 23:05:25.0  ...     19e2e  /+cKZKIp41  /+cKZKIp41
2     sms     25  2012-05-06 23:05:41.0  ...     19e2e  /u0FSD+ahi  /u0FSD+ahi
3   Voice     56  2012-05-06 23:05:42.0  ...     19e2e  +cNeJzsTp3  +cNeJzsTp3
4   Voice     14  2012-05-06 23:06:29.0  ...     19e2e  051KhYDCpv  051KhYDCpv

[5 rows x 10 columns]

In [47]:
df5 = pd.merge(df4,cells_geo, on =('CELL_ID','SITE_ID'), how = 'outer')
df5.head()

  PRODUCT  VALUE              DATE_TIME  ... LATITUDE REGION AREA
0   Voice    0.0  2012-05-06 23:04:37.0  ...      NaN    NaN  NaN
1     sms    0.0  2012-05-06 23:40:48.0  ...      NaN    NaN  NaN
2     sms    0.0  2012-05-07 23:32:47.0  ...      NaN    NaN  NaN
3     sms    0.0  2012-05-07 23:52:21.0  ...      NaN    NaN  NaN
4    data    0.0  2012-05-07 23:53:21.0  ...      NaN    NaN  NaN

[5 rows x 20 columns]

In [48]:
df5.drop_duplicates() #checking for duplicate values
df5.isna() #checking for missing values number
df5.drop(['Unnamed: 0', 'VILLES','STATUS','LOCALISATION','DECOUPZONE','ZONENAME','LONGITUDE','LATITUDE','REGION','AREA', 'COUNTRY_A', 'COUNTRY_B'], axis = 1) #dropping columns
df6 = df5.dropna(how = "any") #drops records with any missing values
df6

Empty DataFrame
Columns: [PRODUCT, VALUE, DATE_TIME, CELL_ON_SITE, DW_A_NUMBER, DW_B_NUMBER, COUNTRY_A, COUNTRY_B, CELL_ID, SITE_ID, Unnamed: 0, VILLES, STATUS, LOCALISATION, DECOUPZONE, ZONENAME, LONGITUDE, LATITUDE, REGION, AREA]
Index: []

In [42]:
#confirming that all null records have been dropped
df6.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 0 entries
Data columns (total 26 columns):
CELLID             0 non-null object
CELL_ID            0 non-null object
CELL_ON_SITE       0 non-null object
COUNTRY_A          0 non-null object
COUNTRY_B          0 non-null object
DATETIME           0 non-null object
DATE_TIME          0 non-null object
DW_A_NUMBER        0 non-null object
DW_A_NUMBER_INT    0 non-null object
DW_B_NUMBER        0 non-null object
DW_B_NUMBER_INT    0 non-null object
PRODUCT            0 non-null object
PRODUTC            0 non-null object
SIET_ID            0 non-null object
SITE_ID            0 non-null object
VALUE              0 non-null float64
Unnamed: 0         0 non-null float64
VILLES             0 non-null object
STATUS             0 non-null object
LOCALISATION       0 non-null object
DECOUPZONE         0 non-null object
ZONENAME           0 non-null object
LONGITUDE          0 non-null float64
LATITUDE           0 non-null float64
REGION             0 non-null object
AREA               0 non-null object
dtypes: float64(4), object(22)
memory usage: 0.0+ bytes

In [45]:
# grouping values
df5['VALUE'].groupby(df5['PRODUCT']).mean()

PRODUCT
Voice    59.101828
data      7.028787
sms       7.840267
Name: VALUE, dtype: float64